constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          784;
        startFace       388141;
    }
    outlet
    {
        type            patch;
        nFaces          784;
        startFace       388925;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3360;
        startFace       389709;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3896;
        startFace       393069;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3360;
        startFace       396965;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4109;
        startFace       400325;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16755;
        startFace       404434;
    }
)

// ************************************************************************* //
