constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel    linearGeometryTotalDisplacement;
//solidModel    unsLinearGeometry;
//solidModel    nonLinearGeometryTotalLagrangian;
//solidModel    nonLinearGeometryUpdatedLagrangian;
//solidModel    unsNonLinearGeometryTotalLagrangian;

"linearGeometryTotalDisplacementCoeffs|unsLinearGeometryCoeffs"
{
    // Solution tolerance for displacement
    solutionTolerance       1e-06;

    // Alternative solution tolerance for displacement
    alternativeTolerance    1e-06;

    // Write frequency for the residuals
    infoFrequency           10;
}

nonLinearGeometryTotalLagrangianCoeffs
{
    // Maximum number of momentum correctors
    nCorrectors             100000;

    // Solution tolerance for displacement
    solutionTolerance       1e-07;

    // Alternative solution tolerance for displacement
    alternativeTolerance    1e-07;

    // Material law solution tolerance
    materialTolerance       1e-05;

    // Write frequency for the residuals
    infoFrequency           100;

}

nonLinearGeometryUpdatedLagrangianCoeffs
{}

unsNonLinearGeometryTotalLagrangianCoeffs
{}

unsNonLinearGeometryUpdatedLagrangianCoeffs
{}

// ************************************************************************* //
