system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.0002;

writeControl    adjustable;

writeInterval   0.001;

purgeWrite      5;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           .1;

functions
{
    principalStresses1
    {
        type principalStresses;
  
        // Optional
        compressionPositive   true;
        region    solid;
    }

    forces
    {
        type                forces;
        region              fluid;
        libs                ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             (interface);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 true;
        rhoInf              1000;
        CofR                (0.5 0.1 0);
	executeControl  timeStep;
        executeInterval 50;
        writeControl    writeTime;

    }
    displacement
    {
        type                solidPointDisplacement;
        point               (0 0.5 0.475);
	executeControl  timeStep;
        executeInterval 50;
        writeControl    writeTime;
    }
}

// ************************************************************************* //
